rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (id != '1' AND director = 'George Lucas')
SELECT COUNT(*) FROM "movies" WHERE (id != '1' AND director = 'George Lucas')
---
  def similarMovies

    @movie = Movie.find(params[:movie_id])
    @similar_movies = Movie.where('id != ? AND director = ?', params[:movie_id], @movie.director)

    if @similar_movies.empty?

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "movies" SET "title" = ?, "description" = ?, "director" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "name"], ["description", "best"], ["director", "dude"], ["updated_at", "2018-10-03 03:43:54.680417"], ["id", 1]]
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)